PH/batch/OfflineWTB_HaiPay/BatchServiceSoap.BatchIn.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="http://merchant.happycz.com.cn/BatchServiceSoap"
 xmlns:ns1="http://merchant.happycz.com.cn"
 xmlns:ns3="http://merchant.happycz.com.cn/BatchServiceSoap12">
 <SOAP-ENV:Body>
   <ns1:BatchIn>
    <MERCODE></MERCODE>
    <DETAILSID></DETAILSID>
    <FLAG>0</FLAG>
    <NAME></NAME>
    <IDCARD></IDCARD>
    <MOBILEPHONE></MOBILEPHONE>
    <BANKNAME></BANKNAME>
    <BRANCHBANKNAME></BRANCHBANKNAME>
    <ACCOUNT></ACCOUNT>
    <AMOUNT></AMOUNT>
    <DCREATETIME></DCREATETIME>
    <PROVINCENAME></PROVINCENAME>
    <CITYNAME></CITYNAME>
    <SIGN></SIGN>
   </ns1:BatchIn>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
